RT-Thread/rt-thread/bsp/tm4c123bsp/libraries/TivaWare_C_series/tm4c123_driverlib/driverlib/rom_map.h
//*****************************************************************************
//
// Macros for the CRC API.
//
//*****************************************************************************
#ifdef ROM_CRCConfigSet
#define MAP_CRCConfigSet                                                      \
        ROM_CRCConfigSet
#else
#define MAP_CRCConfigSet                                                      \
        CRCConfigSet
#endif
#ifdef ROM_CRCDataProcess
#define MAP_CRCDataProcess                                                    \
        ROM_CRCDataProcess
#else
#define MAP_CRCDataProcess                                                    \
        CRCDataProcess
#endif
#ifdef ROM_CRCDataWrite
#define MAP_CRCDataWrite                                                      \
        ROM_CRCDataWrite
#else
#define MAP_CRCDataWrite                                                      \
        CRCDataWrite
#endif
#ifdef ROM_CRCResultRead
#define MAP_CRCResultRead                                                     \
        ROM_CRCResultRead
#else
#define MAP_CRCResultRead                                                     \
        CRCResultRead
#endif
#ifdef ROM_CRCSeedSet
#define MAP_CRCSeedSet                                                        \
        ROM_CRCSeedSet
#else
#define MAP_CRCSeedSet                                                        \
        CRCSeedSet
#endif

//*****************************************************************************
//
// Macros for the DES API.
//
//*****************************************************************************
#ifdef ROM_DESIntStatus
#define MAP_DESIntStatus                                                      \
        ROM_DESIntStatus
#else
#define MAP_DESIntStatus                                                      \
        DESIntStatus
#endif
#ifdef ROM_DESConfigSet
#define MAP_DESConfigSet                                                      \
        ROM_DESConfigSet
#else
#define MAP_DESConfigSet                                                      \
        DESConfigSet
#endif
#ifdef ROM_DESDataRead
#define MAP_DESDataRead                                                       \
        ROM_DESDataRead
#else
#define MAP_DESDataRead                                                       \
        DESDataRead
#endif
#ifdef ROM_DESDataReadNonBlocking
#define MAP_DESDataReadNonBlocking                                            \
        ROM_DESDataReadNonBlocking
#else
#define MAP_DESDataReadNonBlocking                                            \
        DESDataReadNonBlocking
#endif
#ifdef ROM_DESDataProcess
#define MAP_DESDataProcess                                                    \
        ROM_DESDataProcess
#else
#define MAP_DESDataProcess                                                    \
        DESDataProcess
#endif
#ifdef ROM_DESDataWrite
#define MAP_DESDataWrite                                                      \
        ROM_DESDataWrite
#else
#define MAP_DESDataWrite                                                      \
        DESDataWrite
#endif
#ifdef ROM_DESDataWriteNonBlocking
#define MAP_DESDataWriteNonBlocking                                           \
        ROM_DESDataWriteNonBlocking
#else
#define MAP_DESDataWriteNonBlocking                                           \
        DESDataWriteNonBlocking
#endif
#ifdef ROM_DESDMADisable
#define MAP_DESDMADisable                                                     \
        ROM_DESDMADisable
#else
#define MAP_DESDMADisable                                                     \
        DESDMADisable
#endif
#ifdef ROM_DESDMAEnable
#define MAP_DESDMAEnable                                                      \
        ROM_DESDMAEnable
#else
#define MAP_DESDMAEnable                                                      \
        DESDMAEnable
#endif
#ifdef ROM_DESIntClear
#define MAP_DESIntClear                                                       \
        ROM_DESIntClear
#else
#define MAP_DESIntClear                                                       \
        DESIntClear
#endif
#ifdef ROM_DESIntDisable
#define MAP_DESIntDisable                                                     \
        ROM_DESIntDisable
#else
#define MAP_DESIntDisable                                                     \
        DESIntDisable
#endif
#ifdef ROM_DESIntEnable
#define MAP_DESIntEnable                                                      \
        ROM_DESIntEnable
#else
#define MAP_DESIntEnable                                                      \
        DESIntEnable
#endif
#ifdef ROM_DESIVSet
#define MAP_DESIVSet                                                          \
        ROM_DESIVSet
#else
#define MAP_DESIVSet                                                          \
        DESIVSet
#endif
#ifdef ROM_DESKeySet
#define MAP_DESKeySet                                                         \
        ROM_DESKeySet
#else
#define MAP_DESKeySet                                                         \
        DESKeySet
#endif
#ifdef ROM_DESLengthSet
#define MAP_DESLengthSet                                                      \
        ROM_DESLengthSet
#else
#define MAP_DESLengthSet                                                      \
        DESLengthSet
#endif
#ifdef ROM_DESReset
#define MAP_DESReset                                                          \
        ROM_DESReset
#else
#define MAP_DESReset                                                          \
        DESReset
#endif

//*****************************************************************************
//
// Macros for the EEPROM API.
//
//*****************************************************************************
#ifdef ROM_EEPROMRead
#define MAP_EEPROMRead                                                        \
        ROM_EEPROMRead
#else
#define MAP_EEPROMRead                                                        \
        EEPROMRead
#endif
#ifdef ROM_EEPROMBlockCountGet
#define MAP_EEPROMBlockCountGet                                               \
        ROM_EEPROMBlockCountGet
#else
#define MAP_EEPROMBlockCountGet                                               \
        EEPROMBlockCountGet
#endif
#ifdef ROM_EEPROMBlockHide
#define MAP_EEPROMBlockHide                                                   \
        ROM_EEPROMBlockHide
#else
#define MAP_EEPROMBlockHide                                                   \
        EEPROMBlockHide
#endif
#ifdef ROM_EEPROMBlockLock
#define MAP_EEPROMBlockLock                                                   \
        ROM_EEPROMBlockLock
#else
#define MAP_EEPROMBlockLock                                                   \
        EEPROMBlockLock
#endif
#ifdef ROM_EEPROMBlockPasswordSet
#define MAP_EEPROMBlockPasswordSet                                            \
        ROM_EEPROMBlockPasswordSet
#else
#define MAP_EEPROMBlockPasswordSet                                            \
        EEPROMBlockPasswordSet
#endif
#ifdef ROM_EEPROMBlockProtectGet
#define MAP_EEPROMBlockProtectGet                                             \
        ROM_EEPROMBlockProtectGet
#else
#define MAP_EEPROMBlockProtectGet                                             \
        EEPROMBlockProtectGet
#endif
#ifdef ROM_EEPROMBlockProtectSet
#define MAP_EEPROMBlockProtectSet                                             \
        ROM_EEPROMBlockProtectSet
#else
#define MAP_EEPROMBlockProtectSet                                             \
        EEPROMBlockProtectSet
#endif
#ifdef ROM_EEPROMBlockUnlock
#define MAP_EEPROMBlockUnlock                                                 \
        ROM_EEPROMBlockUnlock
#else
#define MAP_EEPROMBlockUnlock                                                 \
        EEPROMBlockUnlock
#endif
#ifdef ROM_EEPROMIntClear
#define MAP_EEPROMIntClear                                                    \
        ROM_EEPROMIntClear
#else
#define MAP_EEPROMIntClear                                                    \
        EEPROMIntClear
#endif
#ifdef ROM_EEPROMIntDisable
#define MAP_EEPROMIntDisable                                                  \
        ROM_EEPROMIntDisable
#else
#define MAP_EEPROMIntDisable                                                  \
        EEPROMIntDisable
#endif
#ifdef ROM_EEPROMIntEnable
#define MAP_EEPROMIntEnable                                                   \
        ROM_EEPROMIntEnable
#else
#define MAP_EEPROMIntEnable                                                   \
        EEPROMIntEnable
#endif
#ifdef ROM_EEPROMIntStatus
#define MAP_EEPROMIntStatus                                                   \
        ROM_EEPROMIntStatus
#else
#define MAP_EEPROMIntStatus                                                   \
        EEPROMIntStatus
#endif
#ifdef ROM_EEPROMMassErase
#define MAP_EEPROMMassErase                                                   \
        ROM_EEPROMMassErase
#else
#define MAP_EEPROMMassErase                                                   \
        EEPROMMassErase
#endif
#ifdef ROM_EEPROMProgram
#define MAP_EEPROMProgram                                                     \
        ROM_EEPROMProgram
#else
#define MAP_EEPROMProgram                                                     \
        EEPROMProgram
#endif
#ifdef ROM_EEPROMProgramNonBlocking
#define MAP_EEPROMProgramNonBlocking                                          \
        ROM_EEPROMProgramNonBlocking
#else
#define MAP_EEPROMProgramNonBlocking                                          \
        EEPROMProgramNonBlocking
#endif
#ifdef ROM_EEPROMSizeGet
#define MAP_EEPROMSizeGet                                                     \
        ROM_EEPROMSizeGet
#else
#define MAP_EEPROMSizeGet                                                     \
        EEPROMSizeGet
#endif
#ifdef ROM_EEPROMStatusGet
#define MAP_EEPROMStatusGet                                                   \
        ROM_EEPROMStatusGet
#else
#define MAP_EEPROMStatusGet                                                   \
        EEPROMStatusGet
#endif
#ifdef ROM_EEPROMInit
#define MAP_EEPROMInit                                                        \
        ROM_EEPROMInit
#else
#define MAP_EEPROMInit                                                        \
        EEPROMInit
#endif

//*****************************************************************************
//
// Macros for the EPI API.
//
//*****************************************************************************
#ifdef ROM_EPIIntStatus
#define MAP_EPIIntStatus                                                      \
        ROM_EPIIntStatus
#else
#define MAP_EPIIntStatus                                                      \
        EPIIntStatus
#endif
#ifdef ROM_EPIModeSet
#define MAP_EPIModeSet                                                        \
        ROM_EPIModeSet
#else
#define MAP_EPIModeSet                                                        \
        EPIModeSet
#endif
#ifdef ROM_EPIDividerSet
#define MAP_EPIDividerSet                                                     \
        ROM_EPIDividerSet
#else
#define MAP_EPIDividerSet                                                     \
        EPIDividerSet
#endif
#ifdef ROM_EPIConfigSDRAMSet
#define MAP_EPIConfigSDRAMSet                                                 \
        ROM_EPIConfigSDRAMSet
#else
#define MAP_EPIConfigSDRAMSet                                                 \
        EPIConfigSDRAMSet
#endif
#ifdef ROM_EPIConfigGPModeSet
#define MAP_EPIConfigGPModeSet                                                \
        ROM_EPIConfigGPModeSet
#else
#define MAP_EPIConfigGPModeSet                                                \
        EPIConfigGPModeSet
#endif
#ifdef ROM_EPIConfigHB8Set
#define MAP_EPIConfigHB8Set                                                   \
        ROM_EPIConfigHB8Set
#else
#define MAP_EPIConfigHB8Set                                                   \
        EPIConfigHB8Set
#endif
#ifdef ROM_EPIConfigHB16Set
#define MAP_EPIConfigHB16Set                                                  \
        ROM_EPIConfigHB16Set
#else
#define MAP_EPIConfigHB16Set                                                  \
        EPIConfigHB16Set
#endif
#ifdef ROM_EPIAddressMapSet
#define MAP_EPIAddressMapSet                                                  \
        ROM_EPIAddressMapSet
#else
#define MAP_EPIAddressMapSet                                                  \
        EPIAddressMapSet
#endif
#ifdef ROM_EPINonBlockingReadConfigure
#define MAP_EPINonBlockingReadConfigure                                       \
        ROM_EPINonBlockingReadConfigure
#else
#define MAP_EPINonBlockingReadConfigure                                       \
        EPINonBlockingReadConfigure
#endif
#ifdef ROM_EPINonBlockingReadStart
#define MAP_EPINonBlockingReadStart                                           \
        ROM_EPINonBlockingReadStart
#else
#define MAP_EPINonBlockingReadStart                                           \
        EPINonBlockingReadStart
#endif
#ifdef ROM_EPINonBlockingReadStop
#define MAP_EPINonBlockingReadStop                                            \
        ROM_EPINonBlockingReadStop
#else
#define MAP_EPINonBlockingReadStop                                            \
        EPINonBlockingReadStop
#endif
#ifdef ROM_EPINonBlockingReadCount
#define MAP_EPINonBlockingReadCount                                           \
        ROM_EPINonBlockingReadCount
#else
#define MAP_EPINonBlockingReadCount                                           \
        EPINonBlockingReadCount
#endif
#ifdef ROM_EPINonBlockingReadAvail
#define MAP_EPINonBlockingReadAvail                                           \
        ROM_EPINonBlockingReadAvail
#else
#define MAP_EPINonBlockingReadAvail                                           \
        EPINonBlockingReadAvail
#endif
#ifdef ROM_EPINonBlockingReadGet32
#define MAP_EPINonBlockingReadGet32                                           \
        ROM_EPINonBlockingReadGet32
#else
#define MAP_EPINonBlockingReadGet32                                           \
        EPINonBlockingReadGet32
#endif
#ifdef ROM_EPINonBlockingReadGet16
#define MAP_EPINonBlockingReadGet16                                           \
        ROM_EPINonBlockingReadGet16
#else
#define MAP_EPINonBlockingReadGet16                                           \
        EPINonBlockingReadGet16
#endif
#ifdef ROM_EPINonBlockingReadGet8
#define MAP_EPINonBlockingReadGet8                                            \
        ROM_EPINonBlockingReadGet8
#else
#define MAP_EPINonBlockingReadGet8                                            \
        EPINonBlockingReadGet8
#endif
#ifdef ROM_EPIFIFOConfig
#define MAP_EPIFIFOConfig                                                     \
        ROM_EPIFIFOConfig
#else
#define MAP_EPIFIFOConfig                                                     \
        EPIFIFOConfig
#endif
#ifdef ROM_EPIWriteFIFOCountGet
#define MAP_EPIWriteFIFOCountGet                                              \
        ROM_EPIWriteFIFOCountGet
#else
#define MAP_EPIWriteFIFOCountGet                                              \
        EPIWriteFIFOCountGet
#endif
#ifdef ROM_EPIIntEnable
#define MAP_EPIIntEnable                                                      \
        ROM_EPIIntEnable
#else
#define MAP_EPIIntEnable                                                      \
        EPIIntEnable
#endif
#ifdef ROM_EPIIntDisable
#define MAP_EPIIntDisable                                                     \
        ROM_EPIIntDisable
#else
#define MAP_EPIIntDisable                                                     \
        EPIIntDisable
#endif
#ifdef ROM_EPIIntErrorStatus
#define MAP_EPIIntErrorStatus                                                 \
        ROM_EPIIntErrorStatus
#else
#define MAP_EPIIntErrorStatus                                                 \
        EPIIntErrorStatus
#endif
#ifdef ROM_EPIIntErrorClear
#define MAP_EPIIntErrorClear                                                  \
        ROM_EPIIntErrorClear
#else
#define MAP_EPIIntErrorClear                                                  \
        EPIIntErrorClear
#endif
#ifdef ROM_EPIDividerCSSet
#define MAP_EPIDividerCSSet                                                   \
        ROM_EPIDividerCSSet
#else
#define MAP_EPIDividerCSSet                                                   \
        EPIDividerCSSet
#endif
#ifdef ROM_EPIDMATxCount
#define MAP_EPIDMATxCount                                                     \
        ROM_EPIDMATxCount
#else
#define MAP_EPIDMATxCount                                                     \
        EPIDMATxCount
#endif
#ifdef ROM_EPIConfigHB8CSSet
#define MAP_EPIConfigHB8CSSet                                                 \
        ROM_EPIConfigHB8CSSet
#else
#define MAP_EPIConfigHB8CSSet                                                 \
        EPIConfigHB8CSSet
#endif
#ifdef ROM_EPIConfigHB16CSSet
#define MAP_EPIConfigHB16CSSet                                                \
        ROM_EPIConfigHB16CSSet
#else
#define MAP_EPIConfigHB16CSSet                                                \
        EPIConfigHB16CSSet
#endif
#ifdef ROM_EPIConfigHB8TimingSet
#define MAP_EPIConfigHB8TimingSet                                             \
        ROM_EPIConfigHB8TimingSet
#else
#define MAP_EPIConfigHB8TimingSet                                             \
        EPIConfigHB8TimingSet
#endif
#ifdef ROM_EPIConfigHB16TimingSet
#define MAP_EPIConfigHB16TimingSet                                            \
        ROM_EPIConfigHB16TimingSet
#else
#define MAP_EPIConfigHB16TimingSet                                            \
        EPIConfigHB16TimingSet
#endif
#ifdef ROM_EPIPSRAMConfigRegSet
#define MAP_EPIPSRAMConfigRegSet                                              \
        ROM_EPIPSRAMConfigRegSet
#else
#define MAP_EPIPSRAMConfigRegSet                                              \
        EPIPSRAMConfigRegSet
#endif
#ifdef ROM_EPIPSRAMConfigRegRead
#define MAP_EPIPSRAMConfigRegRead                                             \
        ROM_EPIPSRAMConfigRegRead
#else
#define MAP_EPIPSRAMConfigRegRead                                             \
        EPIPSRAMConfigRegRead
#endif
#ifdef ROM_EPIPSRAMConfigRegGetNonBlocking
#define MAP_EPIPSRAMConfigRegGetNonBlocking                                   \
        ROM_EPIPSRAMConfigRegGetNonBlocking
#else
#define MAP_EPIPSRAMConfigRegGetNonBlocking                                   \
        EPIPSRAMConfigRegGetNonBlocking
#endif
#ifdef ROM_EPIPSRAMConfigRegGet
#define MAP_EPIPSRAMConfigRegGet                                              \
        ROM_EPIPSRAMConfigRegGet
#else
#define MAP_EPIPSRAMConfigRegGet                                              \
        EPIPSRAMConfigRegGet
#endif

