RT-Thread/rt-thread/bsp/tm4c123bsp/libraries/TivaWare_C_series/tm4c123_driverlib/driverlib/rom_map.h
//*****************************************************************************
//
// Macros for the Hibernate API.
//
//*****************************************************************************
#ifdef ROM_HibernateIntClear
#define MAP_HibernateIntClear                                                 \
        ROM_HibernateIntClear
#else
#define MAP_HibernateIntClear                                                 \
        HibernateIntClear
#endif
#ifdef ROM_HibernateEnableExpClk
#define MAP_HibernateEnableExpClk                                             \
        ROM_HibernateEnableExpClk
#else
#define MAP_HibernateEnableExpClk                                             \
        HibernateEnableExpClk
#endif
#ifdef ROM_HibernateDisable
#define MAP_HibernateDisable                                                  \
        ROM_HibernateDisable
#else
#define MAP_HibernateDisable                                                  \
        HibernateDisable
#endif
#ifdef ROM_HibernateRTCEnable
#define MAP_HibernateRTCEnable                                                \
        ROM_HibernateRTCEnable
#else
#define MAP_HibernateRTCEnable                                                \
        HibernateRTCEnable
#endif
#ifdef ROM_HibernateRTCDisable
#define MAP_HibernateRTCDisable                                               \
        ROM_HibernateRTCDisable
#else
#define MAP_HibernateRTCDisable                                               \
        HibernateRTCDisable
#endif
#ifdef ROM_HibernateWakeSet
#define MAP_HibernateWakeSet                                                  \
        ROM_HibernateWakeSet
#else
#define MAP_HibernateWakeSet                                                  \
        HibernateWakeSet
#endif
#ifdef ROM_HibernateWakeGet
#define MAP_HibernateWakeGet                                                  \
        ROM_HibernateWakeGet
#else
#define MAP_HibernateWakeGet                                                  \
        HibernateWakeGet
#endif
#ifdef ROM_HibernateLowBatSet
#define MAP_HibernateLowBatSet                                                \
        ROM_HibernateLowBatSet
#else
#define MAP_HibernateLowBatSet                                                \
        HibernateLowBatSet
#endif
#ifdef ROM_HibernateLowBatGet
#define MAP_HibernateLowBatGet                                                \
        ROM_HibernateLowBatGet
#else
#define MAP_HibernateLowBatGet                                                \
        HibernateLowBatGet
#endif
#ifdef ROM_HibernateRTCSet
#define MAP_HibernateRTCSet                                                   \
        ROM_HibernateRTCSet
#else
#define MAP_HibernateRTCSet                                                   \
        HibernateRTCSet
#endif
#ifdef ROM_HibernateRTCGet
#define MAP_HibernateRTCGet                                                   \
        ROM_HibernateRTCGet
#else
#define MAP_HibernateRTCGet                                                   \
        HibernateRTCGet
#endif
#ifdef ROM_HibernateRTCTrimSet
#define MAP_HibernateRTCTrimSet                                               \
        ROM_HibernateRTCTrimSet
#else
#define MAP_HibernateRTCTrimSet                                               \
        HibernateRTCTrimSet
#endif
#ifdef ROM_HibernateRTCTrimGet
#define MAP_HibernateRTCTrimGet                                               \
        ROM_HibernateRTCTrimGet
#else
#define MAP_HibernateRTCTrimGet                                               \
        HibernateRTCTrimGet
#endif
#ifdef ROM_HibernateDataSet
#define MAP_HibernateDataSet                                                  \
        ROM_HibernateDataSet
#else
#define MAP_HibernateDataSet                                                  \
        HibernateDataSet
#endif
#ifdef ROM_HibernateDataGet
#define MAP_HibernateDataGet                                                  \
        ROM_HibernateDataGet
#else
#define MAP_HibernateDataGet                                                  \
        HibernateDataGet
#endif
#ifdef ROM_HibernateRequest
#define MAP_HibernateRequest                                                  \
        ROM_HibernateRequest
#else
#define MAP_HibernateRequest                                                  \
        HibernateRequest
#endif
#ifdef ROM_HibernateIntEnable
#define MAP_HibernateIntEnable                                                \
        ROM_HibernateIntEnable
#else
#define MAP_HibernateIntEnable                                                \
        HibernateIntEnable
#endif
#ifdef ROM_HibernateIntDisable
#define MAP_HibernateIntDisable                                               \
        ROM_HibernateIntDisable
#else
#define MAP_HibernateIntDisable                                               \
        HibernateIntDisable
#endif
#ifdef ROM_HibernateIntStatus
#define MAP_HibernateIntStatus                                                \
        ROM_HibernateIntStatus
#else
#define MAP_HibernateIntStatus                                                \
        HibernateIntStatus
#endif
#ifdef ROM_HibernateIsActive
#define MAP_HibernateIsActive                                                 \
        ROM_HibernateIsActive
#else
#define MAP_HibernateIsActive                                                 \
        HibernateIsActive
#endif
#ifdef ROM_HibernateRTCSSGet
#define MAP_HibernateRTCSSGet                                                 \
        ROM_HibernateRTCSSGet
#else
#define MAP_HibernateRTCSSGet                                                 \
        HibernateRTCSSGet
#endif
#ifdef ROM_HibernateClockConfig
#define MAP_HibernateClockConfig                                              \
        ROM_HibernateClockConfig
#else
#define MAP_HibernateClockConfig                                              \
        HibernateClockConfig
#endif
#ifdef ROM_HibernateBatCheckStart
#define MAP_HibernateBatCheckStart                                            \
        ROM_HibernateBatCheckStart
#else
#define MAP_HibernateBatCheckStart                                            \
        HibernateBatCheckStart
#endif
#ifdef ROM_HibernateBatCheckDone
#define MAP_HibernateBatCheckDone                                             \
        ROM_HibernateBatCheckDone
#else
#define MAP_HibernateBatCheckDone                                             \
        HibernateBatCheckDone
#endif
#ifdef ROM_HibernateGPIORetentionEnable
#define MAP_HibernateGPIORetentionEnable                                      \
        ROM_HibernateGPIORetentionEnable
#else
#define MAP_HibernateGPIORetentionEnable                                      \
        HibernateGPIORetentionEnable
#endif
#ifdef ROM_HibernateGPIORetentionDisable
#define MAP_HibernateGPIORetentionDisable                                     \
        ROM_HibernateGPIORetentionDisable
#else
#define MAP_HibernateGPIORetentionDisable                                     \
        HibernateGPIORetentionDisable
#endif
#ifdef ROM_HibernateGPIORetentionGet
#define MAP_HibernateGPIORetentionGet                                         \
        ROM_HibernateGPIORetentionGet
#else
#define MAP_HibernateGPIORetentionGet                                         \
        HibernateGPIORetentionGet
#endif
#ifdef ROM_HibernateCounterMode
#define MAP_HibernateCounterMode                                              \
        ROM_HibernateCounterMode
#else
#define MAP_HibernateCounterMode                                              \
        HibernateCounterMode
#endif
#ifdef ROM_HibernateCalendarSet
#define MAP_HibernateCalendarSet                                              \
        ROM_HibernateCalendarSet
#else
#define MAP_HibernateCalendarSet                                              \
        HibernateCalendarSet
#endif
#ifdef ROM_HibernateCalendarGet
#define MAP_HibernateCalendarGet                                              \
        ROM_HibernateCalendarGet
#else
#define MAP_HibernateCalendarGet                                              \
        HibernateCalendarGet
#endif
#ifdef ROM_HibernateCalendarMatchSet
#define MAP_HibernateCalendarMatchSet                                         \
        ROM_HibernateCalendarMatchSet
#else
#define MAP_HibernateCalendarMatchSet                                         \
        HibernateCalendarMatchSet
#endif
#ifdef ROM_HibernateCalendarMatchGet
#define MAP_HibernateCalendarMatchGet                                         \
        ROM_HibernateCalendarMatchGet
#else
#define MAP_HibernateCalendarMatchGet                                         \
        HibernateCalendarMatchGet
#endif
#ifdef ROM_HibernateTamperDisable
#define MAP_HibernateTamperDisable                                            \
        ROM_HibernateTamperDisable
#else
#define MAP_HibernateTamperDisable                                            \
        HibernateTamperDisable
#endif
#ifdef ROM_HibernateTamperEnable
#define MAP_HibernateTamperEnable                                             \
        ROM_HibernateTamperEnable
#else
#define MAP_HibernateTamperEnable                                             \
        HibernateTamperEnable
#endif
#ifdef ROM_HibernateTamperEventsClear
#define MAP_HibernateTamperEventsClear                                        \
        ROM_HibernateTamperEventsClear
#else
#define MAP_HibernateTamperEventsClear                                        \
        HibernateTamperEventsClear
#endif
#ifdef ROM_HibernateTamperEventsConfig
#define MAP_HibernateTamperEventsConfig                                       \
        ROM_HibernateTamperEventsConfig
#else
#define MAP_HibernateTamperEventsConfig                                       \
        HibernateTamperEventsConfig
#endif
#ifdef ROM_HibernateTamperEventsGet
#define MAP_HibernateTamperEventsGet                                          \
        ROM_HibernateTamperEventsGet
#else
#define MAP_HibernateTamperEventsGet                                          \
        HibernateTamperEventsGet
#endif
#ifdef ROM_HibernateTamperExtOscValid
#define MAP_HibernateTamperExtOscValid                                        \
        ROM_HibernateTamperExtOscValid
#else
#define MAP_HibernateTamperExtOscValid                                        \
        HibernateTamperExtOscValid
#endif
#ifdef ROM_HibernateTamperExtOscRecover
#define MAP_HibernateTamperExtOscRecover                                      \
        ROM_HibernateTamperExtOscRecover
#else
#define MAP_HibernateTamperExtOscRecover                                      \
        HibernateTamperExtOscRecover
#endif
#ifdef ROM_HibernateTamperIODisable
#define MAP_HibernateTamperIODisable                                          \
        ROM_HibernateTamperIODisable
#else
#define MAP_HibernateTamperIODisable                                          \
        HibernateTamperIODisable
#endif
#ifdef ROM_HibernateTamperIOEnable
#define MAP_HibernateTamperIOEnable                                           \
        ROM_HibernateTamperIOEnable
#else
#define MAP_HibernateTamperIOEnable                                           \
        HibernateTamperIOEnable
#endif
#ifdef ROM_HibernateTamperStatusGet
#define MAP_HibernateTamperStatusGet                                          \
        ROM_HibernateTamperStatusGet
#else
#define MAP_HibernateTamperStatusGet                                          \
        HibernateTamperStatusGet
#endif
#ifdef ROM_HibernateRTCMatchGet
#define MAP_HibernateRTCMatchGet                                              \
        ROM_HibernateRTCMatchGet
#else
#define MAP_HibernateRTCMatchGet                                              \
        HibernateRTCMatchGet
#endif
#ifdef ROM_HibernateRTCMatchSet
#define MAP_HibernateRTCMatchSet                                              \
        ROM_HibernateRTCMatchSet
#else
#define MAP_HibernateRTCMatchSet                                              \
        HibernateRTCMatchSet
#endif
#ifdef ROM_HibernateRTCSSMatchGet
#define MAP_HibernateRTCSSMatchGet                                            \
        ROM_HibernateRTCSSMatchGet
#else
#define MAP_HibernateRTCSSMatchGet                                            \
        HibernateRTCSSMatchGet
#endif
#ifdef ROM_HibernateRTCSSMatchSet
#define MAP_HibernateRTCSSMatchSet                                            \
        ROM_HibernateRTCSSMatchSet
#else
#define MAP_HibernateRTCSSMatchSet                                            \
        HibernateRTCSSMatchSet
#endif

