RT-Thread/rt-thread/bsp/tm4c123bsp/libraries/TivaWare_C_series/tm4c123_driverlib/driverlib/rom_map.h
//*****************************************************************************
//
// Macros for the I2C API.
//
//*****************************************************************************
#ifdef ROM_I2CMasterDataPut
#define MAP_I2CMasterDataPut                                                  \
        ROM_I2CMasterDataPut
#else
#define MAP_I2CMasterDataPut                                                  \
        I2CMasterDataPut
#endif
#ifdef ROM_I2CMasterInitExpClk
#define MAP_I2CMasterInitExpClk                                               \
        ROM_I2CMasterInitExpClk
#else
#define MAP_I2CMasterInitExpClk                                               \
        I2CMasterInitExpClk
#endif
#ifdef ROM_I2CSlaveInit
#define MAP_I2CSlaveInit                                                      \
        ROM_I2CSlaveInit
#else
#define MAP_I2CSlaveInit                                                      \
        I2CSlaveInit
#endif
#ifdef ROM_I2CMasterEnable
#define MAP_I2CMasterEnable                                                   \
        ROM_I2CMasterEnable
#else
#define MAP_I2CMasterEnable                                                   \
        I2CMasterEnable
#endif
#ifdef ROM_I2CSlaveEnable
#define MAP_I2CSlaveEnable                                                    \
        ROM_I2CSlaveEnable
#else
#define MAP_I2CSlaveEnable                                                    \
        I2CSlaveEnable
#endif
#ifdef ROM_I2CMasterDisable
#define MAP_I2CMasterDisable                                                  \
        ROM_I2CMasterDisable
#else
#define MAP_I2CMasterDisable                                                  \
        I2CMasterDisable
#endif
#ifdef ROM_I2CSlaveDisable
#define MAP_I2CSlaveDisable                                                   \
        ROM_I2CSlaveDisable
#else
#define MAP_I2CSlaveDisable                                                   \
        I2CSlaveDisable
#endif
#ifdef ROM_I2CMasterIntEnable
#define MAP_I2CMasterIntEnable                                                \
        ROM_I2CMasterIntEnable
#else
#define MAP_I2CMasterIntEnable                                                \
        I2CMasterIntEnable
#endif
#ifdef ROM_I2CSlaveIntEnable
#define MAP_I2CSlaveIntEnable                                                 \
        ROM_I2CSlaveIntEnable
#else
#define MAP_I2CSlaveIntEnable                                                 \
        I2CSlaveIntEnable
#endif
#ifdef ROM_I2CMasterIntDisable
#define MAP_I2CMasterIntDisable                                               \
        ROM_I2CMasterIntDisable
#else
#define MAP_I2CMasterIntDisable                                               \
        I2CMasterIntDisable
#endif
#ifdef ROM_I2CSlaveIntDisable
#define MAP_I2CSlaveIntDisable                                                \
        ROM_I2CSlaveIntDisable
#else
#define MAP_I2CSlaveIntDisable                                                \
        I2CSlaveIntDisable
#endif
#ifdef ROM_I2CMasterIntStatus
#define MAP_I2CMasterIntStatus                                                \
        ROM_I2CMasterIntStatus
#else
#define MAP_I2CMasterIntStatus                                                \
        I2CMasterIntStatus
#endif
#ifdef ROM_I2CSlaveIntStatus
#define MAP_I2CSlaveIntStatus                                                 \
        ROM_I2CSlaveIntStatus
#else
#define MAP_I2CSlaveIntStatus                                                 \
        I2CSlaveIntStatus
#endif
#ifdef ROM_I2CMasterIntClear
#define MAP_I2CMasterIntClear                                                 \
        ROM_I2CMasterIntClear
#else
#define MAP_I2CMasterIntClear                                                 \
        I2CMasterIntClear
#endif
#ifdef ROM_I2CSlaveIntClear
#define MAP_I2CSlaveIntClear                                                  \
        ROM_I2CSlaveIntClear
#else
#define MAP_I2CSlaveIntClear                                                  \
        I2CSlaveIntClear
#endif
#ifdef ROM_I2CMasterSlaveAddrSet
#define MAP_I2CMasterSlaveAddrSet                                             \
        ROM_I2CMasterSlaveAddrSet
#else
#define MAP_I2CMasterSlaveAddrSet                                             \
        I2CMasterSlaveAddrSet
#endif
#ifdef ROM_I2CMasterBusy
#define MAP_I2CMasterBusy                                                     \
        ROM_I2CMasterBusy
#else
#define MAP_I2CMasterBusy                                                     \
        I2CMasterBusy
#endif
#ifdef ROM_I2CMasterBusBusy
#define MAP_I2CMasterBusBusy                                                  \
        ROM_I2CMasterBusBusy
#else
#define MAP_I2CMasterBusBusy                                                  \
        I2CMasterBusBusy
#endif
#ifdef ROM_I2CMasterControl
#define MAP_I2CMasterControl                                                  \
        ROM_I2CMasterControl
#else
#define MAP_I2CMasterControl                                                  \
        I2CMasterControl
#endif
#ifdef ROM_I2CMasterErr
#define MAP_I2CMasterErr                                                      \
        ROM_I2CMasterErr
#else
#define MAP_I2CMasterErr                                                      \
        I2CMasterErr
#endif
#ifdef ROM_I2CMasterDataGet
#define MAP_I2CMasterDataGet                                                  \
        ROM_I2CMasterDataGet
#else
#define MAP_I2CMasterDataGet                                                  \
        I2CMasterDataGet
#endif
#ifdef ROM_I2CSlaveStatus
#define MAP_I2CSlaveStatus                                                    \
        ROM_I2CSlaveStatus
#else
#define MAP_I2CSlaveStatus                                                    \
        I2CSlaveStatus
#endif
#ifdef ROM_I2CSlaveDataPut
#define MAP_I2CSlaveDataPut                                                   \
        ROM_I2CSlaveDataPut
#else
#define MAP_I2CSlaveDataPut                                                   \
        I2CSlaveDataPut
#endif
#ifdef ROM_I2CSlaveDataGet
#define MAP_I2CSlaveDataGet                                                   \
        ROM_I2CSlaveDataGet
#else
#define MAP_I2CSlaveDataGet                                                   \
        I2CSlaveDataGet
#endif
#ifdef ROM_I2CSlaveIntEnableEx
#define MAP_I2CSlaveIntEnableEx                                               \
        ROM_I2CSlaveIntEnableEx
#else
#define MAP_I2CSlaveIntEnableEx                                               \
        I2CSlaveIntEnableEx
#endif
#ifdef ROM_I2CSlaveIntDisableEx
#define MAP_I2CSlaveIntDisableEx                                              \
        ROM_I2CSlaveIntDisableEx
#else
#define MAP_I2CSlaveIntDisableEx                                              \
        I2CSlaveIntDisableEx
#endif
#ifdef ROM_I2CSlaveIntStatusEx
#define MAP_I2CSlaveIntStatusEx                                               \
        ROM_I2CSlaveIntStatusEx
#else
#define MAP_I2CSlaveIntStatusEx                                               \
        I2CSlaveIntStatusEx
#endif
#ifdef ROM_I2CSlaveIntClearEx
#define MAP_I2CSlaveIntClearEx                                                \
        ROM_I2CSlaveIntClearEx
#else
#define MAP_I2CSlaveIntClearEx                                                \
        I2CSlaveIntClearEx
#endif
#ifdef ROM_I2CMasterIntEnableEx
#define MAP_I2CMasterIntEnableEx                                              \
        ROM_I2CMasterIntEnableEx
#else
#define MAP_I2CMasterIntEnableEx                                              \
        I2CMasterIntEnableEx
#endif
#ifdef ROM_I2CMasterIntDisableEx
#define MAP_I2CMasterIntDisableEx                                             \
        ROM_I2CMasterIntDisableEx
#else
#define MAP_I2CMasterIntDisableEx                                             \
        I2CMasterIntDisableEx
#endif
#ifdef ROM_I2CMasterIntStatusEx
#define MAP_I2CMasterIntStatusEx                                              \
        ROM_I2CMasterIntStatusEx
#else
#define MAP_I2CMasterIntStatusEx                                              \
        I2CMasterIntStatusEx
#endif
#ifdef ROM_I2CMasterIntClearEx
#define MAP_I2CMasterIntClearEx                                               \
        ROM_I2CMasterIntClearEx
#else
#define MAP_I2CMasterIntClearEx                                               \
        I2CMasterIntClearEx
#endif
#ifdef ROM_I2CMasterTimeoutSet
#define MAP_I2CMasterTimeoutSet                                               \
        ROM_I2CMasterTimeoutSet
#else
#define MAP_I2CMasterTimeoutSet                                               \
        I2CMasterTimeoutSet
#endif
#ifdef ROM_I2CSlaveACKOverride
#define MAP_I2CSlaveACKOverride                                               \
        ROM_I2CSlaveACKOverride
#else
#define MAP_I2CSlaveACKOverride                                               \
        I2CSlaveACKOverride
#endif
#ifdef ROM_I2CSlaveACKValueSet
#define MAP_I2CSlaveACKValueSet                                               \
        ROM_I2CSlaveACKValueSet
#else
#define MAP_I2CSlaveACKValueSet                                               \
        I2CSlaveACKValueSet
#endif
#ifdef ROM_I2CSlaveAddressSet
#define MAP_I2CSlaveAddressSet                                                \
        ROM_I2CSlaveAddressSet
#else
#define MAP_I2CSlaveAddressSet                                                \
        I2CSlaveAddressSet
#endif
#ifdef ROM_I2CMasterLineStateGet
#define MAP_I2CMasterLineStateGet                                             \
        ROM_I2CMasterLineStateGet
#else
#define MAP_I2CMasterLineStateGet                                             \
        I2CMasterLineStateGet
#endif
#ifdef ROM_I2CTxFIFOConfigSet
#define MAP_I2CTxFIFOConfigSet                                                \
        ROM_I2CTxFIFOConfigSet
#else
#define MAP_I2CTxFIFOConfigSet                                                \
        I2CTxFIFOConfigSet
#endif
#ifdef ROM_I2CTxFIFOFlush
#define MAP_I2CTxFIFOFlush                                                    \
        ROM_I2CTxFIFOFlush
#else
#define MAP_I2CTxFIFOFlush                                                    \
        I2CTxFIFOFlush
#endif
#ifdef ROM_I2CRxFIFOConfigSet
#define MAP_I2CRxFIFOConfigSet                                                \
        ROM_I2CRxFIFOConfigSet
#else
#define MAP_I2CRxFIFOConfigSet                                                \
        I2CRxFIFOConfigSet
#endif
#ifdef ROM_I2CRxFIFOFlush
#define MAP_I2CRxFIFOFlush                                                    \
        ROM_I2CRxFIFOFlush
#else
#define MAP_I2CRxFIFOFlush                                                    \
        I2CRxFIFOFlush
#endif
#ifdef ROM_I2CFIFOStatus
#define MAP_I2CFIFOStatus                                                     \
        ROM_I2CFIFOStatus
#else
#define MAP_I2CFIFOStatus                                                     \
        I2CFIFOStatus
#endif
#ifdef ROM_I2CFIFODataPut
#define MAP_I2CFIFODataPut                                                    \
        ROM_I2CFIFODataPut
#else
#define MAP_I2CFIFODataPut                                                    \
        I2CFIFODataPut
#endif
#ifdef ROM_I2CFIFODataPutNonBlocking
#define MAP_I2CFIFODataPutNonBlocking                                         \
        ROM_I2CFIFODataPutNonBlocking
#else
#define MAP_I2CFIFODataPutNonBlocking                                         \
        I2CFIFODataPutNonBlocking
#endif
#ifdef ROM_I2CFIFODataGet
#define MAP_I2CFIFODataGet                                                    \
        ROM_I2CFIFODataGet
#else
#define MAP_I2CFIFODataGet                                                    \
        I2CFIFODataGet
#endif
#ifdef ROM_I2CFIFODataGetNonBlocking
#define MAP_I2CFIFODataGetNonBlocking                                         \
        ROM_I2CFIFODataGetNonBlocking
#else
#define MAP_I2CFIFODataGetNonBlocking                                         \
        I2CFIFODataGetNonBlocking
#endif
#ifdef ROM_I2CMasterBurstLengthSet
#define MAP_I2CMasterBurstLengthSet                                           \
        ROM_I2CMasterBurstLengthSet
#else
#define MAP_I2CMasterBurstLengthSet                                           \
        I2CMasterBurstLengthSet
#endif
#ifdef ROM_I2CMasterBurstCountGet
#define MAP_I2CMasterBurstCountGet                                            \
        ROM_I2CMasterBurstCountGet
#else
#define MAP_I2CMasterBurstCountGet                                            \
        I2CMasterBurstCountGet
#endif
#ifdef ROM_I2CSlaveFIFODisable
#define MAP_I2CSlaveFIFODisable                                               \
        ROM_I2CSlaveFIFODisable
#else
#define MAP_I2CSlaveFIFODisable                                               \
        I2CSlaveFIFODisable
#endif
#ifdef ROM_I2CSlaveFIFOEnable
#define MAP_I2CSlaveFIFOEnable                                                \
        ROM_I2CSlaveFIFOEnable
#else
#define MAP_I2CSlaveFIFOEnable                                                \
        I2CSlaveFIFOEnable
#endif
#ifdef ROM_I2CMasterGlitchFilterConfigSet
#define MAP_I2CMasterGlitchFilterConfigSet                                    \
        ROM_I2CMasterGlitchFilterConfigSet
#else
#define MAP_I2CMasterGlitchFilterConfigSet                                    \
        I2CMasterGlitchFilterConfigSet
#endif

//*****************************************************************************
//
// Macros for the Interrupt API.
//
//*****************************************************************************
#ifdef ROM_IntEnable
#define MAP_IntEnable                                                         \
        ROM_IntEnable
#else
#define MAP_IntEnable                                                         \
        IntEnable
#endif
#ifdef ROM_IntMasterEnable
#define MAP_IntMasterEnable                                                   \
        ROM_IntMasterEnable
#else
#define MAP_IntMasterEnable                                                   \
        IntMasterEnable
#endif
#ifdef ROM_IntMasterDisable
#define MAP_IntMasterDisable                                                  \
        ROM_IntMasterDisable
#else
#define MAP_IntMasterDisable                                                  \
        IntMasterDisable
#endif
#ifdef ROM_IntDisable
#define MAP_IntDisable                                                        \
        ROM_IntDisable
#else
#define MAP_IntDisable                                                        \
        IntDisable
#endif
#ifdef ROM_IntPriorityGroupingSet
#define MAP_IntPriorityGroupingSet                                            \
        ROM_IntPriorityGroupingSet
#else
#define MAP_IntPriorityGroupingSet                                            \
        IntPriorityGroupingSet
#endif
#ifdef ROM_IntPriorityGroupingGet
#define MAP_IntPriorityGroupingGet                                            \
        ROM_IntPriorityGroupingGet
#else
#define MAP_IntPriorityGroupingGet                                            \
        IntPriorityGroupingGet
#endif
#ifdef ROM_IntPrioritySet
#define MAP_IntPrioritySet                                                    \
        ROM_IntPrioritySet
#else
#define MAP_IntPrioritySet                                                    \
        IntPrioritySet
#endif
#ifdef ROM_IntPriorityGet
#define MAP_IntPriorityGet                                                    \
        ROM_IntPriorityGet
#else
#define MAP_IntPriorityGet                                                    \
        IntPriorityGet
#endif
#ifdef ROM_IntPendSet
#define MAP_IntPendSet                                                        \
        ROM_IntPendSet
#else
#define MAP_IntPendSet                                                        \
        IntPendSet
#endif
#ifdef ROM_IntPendClear
#define MAP_IntPendClear                                                      \
        ROM_IntPendClear
#else
#define MAP_IntPendClear                                                      \
        IntPendClear
#endif
#ifdef ROM_IntPriorityMaskSet
#define MAP_IntPriorityMaskSet                                                \
        ROM_IntPriorityMaskSet
#else
#define MAP_IntPriorityMaskSet                                                \
        IntPriorityMaskSet
#endif
#ifdef ROM_IntPriorityMaskGet
#define MAP_IntPriorityMaskGet                                                \
        ROM_IntPriorityMaskGet
#else
#define MAP_IntPriorityMaskGet                                                \
        IntPriorityMaskGet
#endif
#ifdef ROM_IntIsEnabled
#define MAP_IntIsEnabled                                                      \
        ROM_IntIsEnabled
#else
#define MAP_IntIsEnabled                                                      \
        IntIsEnabled
#endif
#ifdef ROM_IntTrigger
#define MAP_IntTrigger                                                        \
        ROM_IntTrigger
#else
#define MAP_IntTrigger                                                        \
        IntTrigger
#endif

