RT-Thread/rt-thread/bsp/tm4c123bsp/libraries/TivaWare_C_series/tm4c123_driverlib/driverlib/rom_map.h
//*****************************************************************************
//
// Macros for the LCD API.
//
//*****************************************************************************
#ifdef ROM_LCDIntStatus
#define MAP_LCDIntStatus                                                      \
        ROM_LCDIntStatus
#else
#define MAP_LCDIntStatus                                                      \
        LCDIntStatus
#endif
#ifdef ROM_LCDClockReset
#define MAP_LCDClockReset                                                     \
        ROM_LCDClockReset
#else
#define MAP_LCDClockReset                                                     \
        LCDClockReset
#endif
#ifdef ROM_LCDDMAConfigSet
#define MAP_LCDDMAConfigSet                                                   \
        ROM_LCDDMAConfigSet
#else
#define MAP_LCDDMAConfigSet                                                   \
        LCDDMAConfigSet
#endif
#ifdef ROM_LCDIDDCommandWrite
#define MAP_LCDIDDCommandWrite                                                \
        ROM_LCDIDDCommandWrite
#else
#define MAP_LCDIDDCommandWrite                                                \
        LCDIDDCommandWrite
#endif
#ifdef ROM_LCDIDDConfigSet
#define MAP_LCDIDDConfigSet                                                   \
        ROM_LCDIDDConfigSet
#else
#define MAP_LCDIDDConfigSet                                                   \
        LCDIDDConfigSet
#endif
#ifdef ROM_LCDIDDDataRead
#define MAP_LCDIDDDataRead                                                    \
        ROM_LCDIDDDataRead
#else
#define MAP_LCDIDDDataRead                                                    \
        LCDIDDDataRead
#endif
#ifdef ROM_LCDIDDDataWrite
#define MAP_LCDIDDDataWrite                                                   \
        ROM_LCDIDDDataWrite
#else
#define MAP_LCDIDDDataWrite                                                   \
        LCDIDDDataWrite
#endif
#ifdef ROM_LCDIDDDMADisable
#define MAP_LCDIDDDMADisable                                                  \
        ROM_LCDIDDDMADisable
#else
#define MAP_LCDIDDDMADisable                                                  \
        LCDIDDDMADisable
#endif
#ifdef ROM_LCDIDDDMAWrite
#define MAP_LCDIDDDMAWrite                                                    \
        ROM_LCDIDDDMAWrite
#else
#define MAP_LCDIDDDMAWrite                                                    \
        LCDIDDDMAWrite
#endif
#ifdef ROM_LCDIDDIndexedRead
#define MAP_LCDIDDIndexedRead                                                 \
        ROM_LCDIDDIndexedRead
#else
#define MAP_LCDIDDIndexedRead                                                 \
        LCDIDDIndexedRead
#endif
#ifdef ROM_LCDIDDIndexedWrite
#define MAP_LCDIDDIndexedWrite                                                \
        ROM_LCDIDDIndexedWrite
#else
#define MAP_LCDIDDIndexedWrite                                                \
        LCDIDDIndexedWrite
#endif
#ifdef ROM_LCDIDDStatusRead
#define MAP_LCDIDDStatusRead                                                  \
        ROM_LCDIDDStatusRead
#else
#define MAP_LCDIDDStatusRead                                                  \
        LCDIDDStatusRead
#endif
#ifdef ROM_LCDIDDTimingSet
#define MAP_LCDIDDTimingSet                                                   \
        ROM_LCDIDDTimingSet
#else
#define MAP_LCDIDDTimingSet                                                   \
        LCDIDDTimingSet
#endif
#ifdef ROM_LCDIntClear
#define MAP_LCDIntClear                                                       \
        ROM_LCDIntClear
#else
#define MAP_LCDIntClear                                                       \
        LCDIntClear
#endif
#ifdef ROM_LCDIntDisable
#define MAP_LCDIntDisable                                                     \
        ROM_LCDIntDisable
#else
#define MAP_LCDIntDisable                                                     \
        LCDIntDisable
#endif
#ifdef ROM_LCDIntEnable
#define MAP_LCDIntEnable                                                      \
        ROM_LCDIntEnable
#else
#define MAP_LCDIntEnable                                                      \
        LCDIntEnable
#endif
#ifdef ROM_LCDModeSet
#define MAP_LCDModeSet                                                        \
        ROM_LCDModeSet
#else
#define MAP_LCDModeSet                                                        \
        LCDModeSet
#endif
#ifdef ROM_LCDRasterACBiasIntCountSet
#define MAP_LCDRasterACBiasIntCountSet                                        \
        ROM_LCDRasterACBiasIntCountSet
#else
#define MAP_LCDRasterACBiasIntCountSet                                        \
        LCDRasterACBiasIntCountSet
#endif
#ifdef ROM_LCDRasterConfigSet
#define MAP_LCDRasterConfigSet                                                \
        ROM_LCDRasterConfigSet
#else
#define MAP_LCDRasterConfigSet                                                \
        LCDRasterConfigSet
#endif
#ifdef ROM_LCDRasterDisable
#define MAP_LCDRasterDisable                                                  \
        ROM_LCDRasterDisable
#else
#define MAP_LCDRasterDisable                                                  \
        LCDRasterDisable
#endif
#ifdef ROM_LCDRasterEnable
#define MAP_LCDRasterEnable                                                   \
        ROM_LCDRasterEnable
#else
#define MAP_LCDRasterEnable                                                   \
        LCDRasterEnable
#endif
#ifdef ROM_LCDRasterFrameBufferSet
#define MAP_LCDRasterFrameBufferSet                                           \
        ROM_LCDRasterFrameBufferSet
#else
#define MAP_LCDRasterFrameBufferSet                                           \
        LCDRasterFrameBufferSet
#endif
#ifdef ROM_LCDRasterPaletteSet
#define MAP_LCDRasterPaletteSet                                               \
        ROM_LCDRasterPaletteSet
#else
#define MAP_LCDRasterPaletteSet                                               \
        LCDRasterPaletteSet
#endif
#ifdef ROM_LCDRasterSubPanelConfigSet
#define MAP_LCDRasterSubPanelConfigSet                                        \
        ROM_LCDRasterSubPanelConfigSet
#else
#define MAP_LCDRasterSubPanelConfigSet                                        \
        LCDRasterSubPanelConfigSet
#endif
#ifdef ROM_LCDRasterSubPanelDisable
#define MAP_LCDRasterSubPanelDisable                                          \
        ROM_LCDRasterSubPanelDisable
#else
#define MAP_LCDRasterSubPanelDisable                                          \
        LCDRasterSubPanelDisable
#endif
#ifdef ROM_LCDRasterSubPanelEnable
#define MAP_LCDRasterSubPanelEnable                                           \
        ROM_LCDRasterSubPanelEnable
#else
#define MAP_LCDRasterSubPanelEnable                                           \
        LCDRasterSubPanelEnable
#endif
#ifdef ROM_LCDRasterTimingSet
#define MAP_LCDRasterTimingSet                                                \
        ROM_LCDRasterTimingSet
#else
#define MAP_LCDRasterTimingSet                                                \
        LCDRasterTimingSet
#endif
#ifdef ROM_LCDRasterEnabled
#define MAP_LCDRasterEnabled                                                  \
        ROM_LCDRasterEnabled
#else
#define MAP_LCDRasterEnabled                                                  \
        LCDRasterEnabled
#endif

//*****************************************************************************
//
// Macros for the MPU API.
//
//*****************************************************************************
#ifdef ROM_MPUEnable
#define MAP_MPUEnable                                                         \
        ROM_MPUEnable
#else
#define MAP_MPUEnable                                                         \
        MPUEnable
#endif
#ifdef ROM_MPUDisable
#define MAP_MPUDisable                                                        \
        ROM_MPUDisable
#else
#define MAP_MPUDisable                                                        \
        MPUDisable
#endif
#ifdef ROM_MPURegionCountGet
#define MAP_MPURegionCountGet                                                 \
        ROM_MPURegionCountGet
#else
#define MAP_MPURegionCountGet                                                 \
        MPURegionCountGet
#endif
#ifdef ROM_MPURegionEnable
#define MAP_MPURegionEnable                                                   \
        ROM_MPURegionEnable
#else
#define MAP_MPURegionEnable                                                   \
        MPURegionEnable
#endif
#ifdef ROM_MPURegionDisable
#define MAP_MPURegionDisable                                                  \
        ROM_MPURegionDisable
#else
#define MAP_MPURegionDisable                                                  \
        MPURegionDisable
#endif
#ifdef ROM_MPURegionSet
#define MAP_MPURegionSet                                                      \
        ROM_MPURegionSet
#else
#define MAP_MPURegionSet                                                      \
        MPURegionSet
#endif
#ifdef ROM_MPURegionGet
#define MAP_MPURegionGet                                                      \
        ROM_MPURegionGet
#else
#define MAP_MPURegionGet                                                      \
        MPURegionGet
#endif

//*****************************************************************************
//
// Macros for the OneWire API.
//
//*****************************************************************************
#ifdef ROM_OneWireIntStatus
#define MAP_OneWireIntStatus                                                  \
        ROM_OneWireIntStatus
#else
#define MAP_OneWireIntStatus                                                  \
        OneWireIntStatus
#endif
#ifdef ROM_OneWireBusReset
#define MAP_OneWireBusReset                                                   \
        ROM_OneWireBusReset
#else
#define MAP_OneWireBusReset                                                   \
        OneWireBusReset
#endif
#ifdef ROM_OneWireBusStatus
#define MAP_OneWireBusStatus                                                  \
        ROM_OneWireBusStatus
#else
#define MAP_OneWireBusStatus                                                  \
        OneWireBusStatus
#endif
#ifdef ROM_OneWireDataGet
#define MAP_OneWireDataGet                                                    \
        ROM_OneWireDataGet
#else
#define MAP_OneWireDataGet                                                    \
        OneWireDataGet
#endif
#ifdef ROM_OneWireDataGetNonBlocking
#define MAP_OneWireDataGetNonBlocking                                         \
        ROM_OneWireDataGetNonBlocking
#else
#define MAP_OneWireDataGetNonBlocking                                         \
        OneWireDataGetNonBlocking
#endif
#ifdef ROM_OneWireInit
#define MAP_OneWireInit                                                       \
        ROM_OneWireInit
#else
#define MAP_OneWireInit                                                       \
        OneWireInit
#endif
#ifdef ROM_OneWireIntClear
#define MAP_OneWireIntClear                                                   \
        ROM_OneWireIntClear
#else
#define MAP_OneWireIntClear                                                   \
        OneWireIntClear
#endif
#ifdef ROM_OneWireIntDisable
#define MAP_OneWireIntDisable                                                 \
        ROM_OneWireIntDisable
#else
#define MAP_OneWireIntDisable                                                 \
        OneWireIntDisable
#endif
#ifdef ROM_OneWireIntEnable
#define MAP_OneWireIntEnable                                                  \
        ROM_OneWireIntEnable
#else
#define MAP_OneWireIntEnable                                                  \
        OneWireIntEnable
#endif
#ifdef ROM_OneWireTransaction
#define MAP_OneWireTransaction                                                \
        ROM_OneWireTransaction
#else
#define MAP_OneWireTransaction                                                \
        OneWireTransaction
#endif
#ifdef ROM_OneWireDMADisable
#define MAP_OneWireDMADisable                                                 \
        ROM_OneWireDMADisable
#else
#define MAP_OneWireDMADisable                                                 \
        OneWireDMADisable
#endif
#ifdef ROM_OneWireDMAEnable
#define MAP_OneWireDMAEnable                                                  \
        ROM_OneWireDMAEnable
#else
#define MAP_OneWireDMAEnable                                                  \
        OneWireDMAEnable
#endif

//*****************************************************************************
//
// Macros for the PWM API.
//
//*****************************************************************************
#ifdef ROM_PWMPulseWidthSet
#define MAP_PWMPulseWidthSet                                                  \
        ROM_PWMPulseWidthSet
#else
#define MAP_PWMPulseWidthSet                                                  \
        PWMPulseWidthSet
#endif
#ifdef ROM_PWMGenConfigure
#define MAP_PWMGenConfigure                                                   \
        ROM_PWMGenConfigure
#else
#define MAP_PWMGenConfigure                                                   \
        PWMGenConfigure
#endif
#ifdef ROM_PWMGenPeriodSet
#define MAP_PWMGenPeriodSet                                                   \
        ROM_PWMGenPeriodSet
#else
#define MAP_PWMGenPeriodSet                                                   \
        PWMGenPeriodSet
#endif
#ifdef ROM_PWMGenPeriodGet
#define MAP_PWMGenPeriodGet                                                   \
        ROM_PWMGenPeriodGet
#else
#define MAP_PWMGenPeriodGet                                                   \
        PWMGenPeriodGet
#endif
#ifdef ROM_PWMGenEnable
#define MAP_PWMGenEnable                                                      \
        ROM_PWMGenEnable
#else
#define MAP_PWMGenEnable                                                      \
        PWMGenEnable
#endif
#ifdef ROM_PWMGenDisable
#define MAP_PWMGenDisable                                                     \
        ROM_PWMGenDisable
#else
#define MAP_PWMGenDisable                                                     \
        PWMGenDisable
#endif
#ifdef ROM_PWMPulseWidthGet
#define MAP_PWMPulseWidthGet                                                  \
        ROM_PWMPulseWidthGet
#else
#define MAP_PWMPulseWidthGet                                                  \
        PWMPulseWidthGet
#endif
#ifdef ROM_PWMDeadBandEnable
#define MAP_PWMDeadBandEnable                                                 \
        ROM_PWMDeadBandEnable
#else
#define MAP_PWMDeadBandEnable                                                 \
        PWMDeadBandEnable
#endif
#ifdef ROM_PWMDeadBandDisable
#define MAP_PWMDeadBandDisable                                                \
        ROM_PWMDeadBandDisable
#else
#define MAP_PWMDeadBandDisable                                                \
        PWMDeadBandDisable
#endif
#ifdef ROM_PWMSyncUpdate
#define MAP_PWMSyncUpdate                                                     \
        ROM_PWMSyncUpdate
#else
#define MAP_PWMSyncUpdate                                                     \
        PWMSyncUpdate
#endif
#ifdef ROM_PWMSyncTimeBase
#define MAP_PWMSyncTimeBase                                                   \
        ROM_PWMSyncTimeBase
#else
#define MAP_PWMSyncTimeBase                                                   \
        PWMSyncTimeBase
#endif
#ifdef ROM_PWMOutputState
#define MAP_PWMOutputState                                                    \
        ROM_PWMOutputState
#else
#define MAP_PWMOutputState                                                    \
        PWMOutputState
#endif
#ifdef ROM_PWMOutputInvert
#define MAP_PWMOutputInvert                                                   \
        ROM_PWMOutputInvert
#else
#define MAP_PWMOutputInvert                                                   \
        PWMOutputInvert
#endif
#ifdef ROM_PWMOutputFault
#define MAP_PWMOutputFault                                                    \
        ROM_PWMOutputFault
#else
#define MAP_PWMOutputFault                                                    \
        PWMOutputFault
#endif
#ifdef ROM_PWMGenIntTrigEnable
#define MAP_PWMGenIntTrigEnable                                               \
        ROM_PWMGenIntTrigEnable
#else
#define MAP_PWMGenIntTrigEnable                                               \
        PWMGenIntTrigEnable
#endif
#ifdef ROM_PWMGenIntTrigDisable
#define MAP_PWMGenIntTrigDisable                                              \
        ROM_PWMGenIntTrigDisable
#else
#define MAP_PWMGenIntTrigDisable                                              \
        PWMGenIntTrigDisable
#endif
#ifdef ROM_PWMGenIntStatus
#define MAP_PWMGenIntStatus                                                   \
        ROM_PWMGenIntStatus
#else
#define MAP_PWMGenIntStatus                                                   \
        PWMGenIntStatus
#endif
#ifdef ROM_PWMGenIntClear
#define MAP_PWMGenIntClear                                                    \
        ROM_PWMGenIntClear
#else
#define MAP_PWMGenIntClear                                                    \
        PWMGenIntClear
#endif
#ifdef ROM_PWMIntEnable
#define MAP_PWMIntEnable                                                      \
        ROM_PWMIntEnable
#else
#define MAP_PWMIntEnable                                                      \
        PWMIntEnable
#endif
#ifdef ROM_PWMIntDisable
#define MAP_PWMIntDisable                                                     \
        ROM_PWMIntDisable
#else
#define MAP_PWMIntDisable                                                     \
        PWMIntDisable
#endif
#ifdef ROM_PWMFaultIntClear
#define MAP_PWMFaultIntClear                                                  \
        ROM_PWMFaultIntClear
#else
#define MAP_PWMFaultIntClear                                                  \
        PWMFaultIntClear
#endif
#ifdef ROM_PWMIntStatus
#define MAP_PWMIntStatus                                                      \
        ROM_PWMIntStatus
#else
#define MAP_PWMIntStatus                                                      \
        PWMIntStatus
#endif
#ifdef ROM_PWMOutputFaultLevel
#define MAP_PWMOutputFaultLevel                                               \
        ROM_PWMOutputFaultLevel
#else
#define MAP_PWMOutputFaultLevel                                               \
        PWMOutputFaultLevel
#endif
#ifdef ROM_PWMFaultIntClearExt
#define MAP_PWMFaultIntClearExt                                               \
        ROM_PWMFaultIntClearExt
#else
#define MAP_PWMFaultIntClearExt                                               \
        PWMFaultIntClearExt
#endif
#ifdef ROM_PWMGenFaultConfigure
#define MAP_PWMGenFaultConfigure                                              \
        ROM_PWMGenFaultConfigure
#else
#define MAP_PWMGenFaultConfigure                                              \
        PWMGenFaultConfigure
#endif
#ifdef ROM_PWMGenFaultTriggerSet
#define MAP_PWMGenFaultTriggerSet                                             \
        ROM_PWMGenFaultTriggerSet
#else
#define MAP_PWMGenFaultTriggerSet                                             \
        PWMGenFaultTriggerSet
#endif
#ifdef ROM_PWMGenFaultTriggerGet
#define MAP_PWMGenFaultTriggerGet                                             \
        ROM_PWMGenFaultTriggerGet
#else
#define MAP_PWMGenFaultTriggerGet                                             \
        PWMGenFaultTriggerGet
#endif
#ifdef ROM_PWMGenFaultStatus
#define MAP_PWMGenFaultStatus                                                 \
        ROM_PWMGenFaultStatus
#else
#define MAP_PWMGenFaultStatus                                                 \
        PWMGenFaultStatus
#endif
#ifdef ROM_PWMGenFaultClear
#define MAP_PWMGenFaultClear                                                  \
        ROM_PWMGenFaultClear
#else
#define MAP_PWMGenFaultClear                                                  \
        PWMGenFaultClear
#endif
#ifdef ROM_PWMClockSet
#define MAP_PWMClockSet                                                       \
        ROM_PWMClockSet
#else
#define MAP_PWMClockSet                                                       \
        PWMClockSet
#endif
#ifdef ROM_PWMClockGet
#define MAP_PWMClockGet                                                       \
        ROM_PWMClockGet
#else
#define MAP_PWMClockGet                                                       \
        PWMClockGet
#endif
#ifdef ROM_PWMOutputUpdateMode
#define MAP_PWMOutputUpdateMode                                               \
        ROM_PWMOutputUpdateMode
#else
#define MAP_PWMOutputUpdateMode                                               \
        PWMOutputUpdateMode
#endif

