RT-Thread/rt-thread/bsp/tm4c123bsp/libraries/TivaWare_C_series/tm4c123_driverlib/driverlib/rom_map.h
//*****************************************************************************
//
// Macros for the QEI API.
//
//*****************************************************************************
#ifdef ROM_QEIPositionGet
#define MAP_QEIPositionGet                                                    \
        ROM_QEIPositionGet
#else
#define MAP_QEIPositionGet                                                    \
        QEIPositionGet
#endif
#ifdef ROM_QEIEnable
#define MAP_QEIEnable                                                         \
        ROM_QEIEnable
#else
#define MAP_QEIEnable                                                         \
        QEIEnable
#endif
#ifdef ROM_QEIDisable
#define MAP_QEIDisable                                                        \
        ROM_QEIDisable
#else
#define MAP_QEIDisable                                                        \
        QEIDisable
#endif
#ifdef ROM_QEIConfigure
#define MAP_QEIConfigure                                                      \
        ROM_QEIConfigure
#else
#define MAP_QEIConfigure                                                      \
        QEIConfigure
#endif
#ifdef ROM_QEIPositionSet
#define MAP_QEIPositionSet                                                    \
        ROM_QEIPositionSet
#else
#define MAP_QEIPositionSet                                                    \
        QEIPositionSet
#endif
#ifdef ROM_QEIDirectionGet
#define MAP_QEIDirectionGet                                                   \
        ROM_QEIDirectionGet
#else
#define MAP_QEIDirectionGet                                                   \
        QEIDirectionGet
#endif
#ifdef ROM_QEIErrorGet
#define MAP_QEIErrorGet                                                       \
        ROM_QEIErrorGet
#else
#define MAP_QEIErrorGet                                                       \
        QEIErrorGet
#endif
#ifdef ROM_QEIVelocityEnable
#define MAP_QEIVelocityEnable                                                 \
        ROM_QEIVelocityEnable
#else
#define MAP_QEIVelocityEnable                                                 \
        QEIVelocityEnable
#endif
#ifdef ROM_QEIVelocityDisable
#define MAP_QEIVelocityDisable                                                \
        ROM_QEIVelocityDisable
#else
#define MAP_QEIVelocityDisable                                                \
        QEIVelocityDisable
#endif
#ifdef ROM_QEIVelocityConfigure
#define MAP_QEIVelocityConfigure                                              \
        ROM_QEIVelocityConfigure
#else
#define MAP_QEIVelocityConfigure                                              \
        QEIVelocityConfigure
#endif
#ifdef ROM_QEIVelocityGet
#define MAP_QEIVelocityGet                                                    \
        ROM_QEIVelocityGet
#else
#define MAP_QEIVelocityGet                                                    \
        QEIVelocityGet
#endif
#ifdef ROM_QEIIntEnable
#define MAP_QEIIntEnable                                                      \
        ROM_QEIIntEnable
#else
#define MAP_QEIIntEnable                                                      \
        QEIIntEnable
#endif
#ifdef ROM_QEIIntDisable
#define MAP_QEIIntDisable                                                     \
        ROM_QEIIntDisable
#else
#define MAP_QEIIntDisable                                                     \
        QEIIntDisable
#endif
#ifdef ROM_QEIIntStatus
#define MAP_QEIIntStatus                                                      \
        ROM_QEIIntStatus
#else
#define MAP_QEIIntStatus                                                      \
        QEIIntStatus
#endif
#ifdef ROM_QEIIntClear
#define MAP_QEIIntClear                                                       \
        ROM_QEIIntClear
#else
#define MAP_QEIIntClear                                                       \
        QEIIntClear
#endif

//*****************************************************************************
//
// Macros for the SHAMD5 API.
//
//*****************************************************************************
#ifdef ROM_SHAMD5IntStatus
#define MAP_SHAMD5IntStatus                                                   \
        ROM_SHAMD5IntStatus
#else
#define MAP_SHAMD5IntStatus                                                   \
        SHAMD5IntStatus
#endif
#ifdef ROM_SHAMD5ConfigSet
#define MAP_SHAMD5ConfigSet                                                   \
        ROM_SHAMD5ConfigSet
#else
#define MAP_SHAMD5ConfigSet                                                   \
        SHAMD5ConfigSet
#endif
#ifdef ROM_SHAMD5DataProcess
#define MAP_SHAMD5DataProcess                                                 \
        ROM_SHAMD5DataProcess
#else
#define MAP_SHAMD5DataProcess                                                 \
        SHAMD5DataProcess
#endif
#ifdef ROM_SHAMD5DataWrite
#define MAP_SHAMD5DataWrite                                                   \
        ROM_SHAMD5DataWrite
#else
#define MAP_SHAMD5DataWrite                                                   \
        SHAMD5DataWrite
#endif
#ifdef ROM_SHAMD5DataWriteNonBlocking
#define MAP_SHAMD5DataWriteNonBlocking                                        \
        ROM_SHAMD5DataWriteNonBlocking
#else
#define MAP_SHAMD5DataWriteNonBlocking                                        \
        SHAMD5DataWriteNonBlocking
#endif
#ifdef ROM_SHAMD5DMADisable
#define MAP_SHAMD5DMADisable                                                  \
        ROM_SHAMD5DMADisable
#else
#define MAP_SHAMD5DMADisable                                                  \
        SHAMD5DMADisable
#endif
#ifdef ROM_SHAMD5DMAEnable
#define MAP_SHAMD5DMAEnable                                                   \
        ROM_SHAMD5DMAEnable
#else
#define MAP_SHAMD5DMAEnable                                                   \
        SHAMD5DMAEnable
#endif
#ifdef ROM_SHAMD5HashLengthSet
#define MAP_SHAMD5HashLengthSet                                               \
        ROM_SHAMD5HashLengthSet
#else
#define MAP_SHAMD5HashLengthSet                                               \
        SHAMD5HashLengthSet
#endif
#ifdef ROM_SHAMD5HMACKeySet
#define MAP_SHAMD5HMACKeySet                                                  \
        ROM_SHAMD5HMACKeySet
#else
#define MAP_SHAMD5HMACKeySet                                                  \
        SHAMD5HMACKeySet
#endif
#ifdef ROM_SHAMD5HMACPPKeyGenerate
#define MAP_SHAMD5HMACPPKeyGenerate                                           \
        ROM_SHAMD5HMACPPKeyGenerate
#else
#define MAP_SHAMD5HMACPPKeyGenerate                                           \
        SHAMD5HMACPPKeyGenerate
#endif
#ifdef ROM_SHAMD5HMACPPKeySet
#define MAP_SHAMD5HMACPPKeySet                                                \
        ROM_SHAMD5HMACPPKeySet
#else
#define MAP_SHAMD5HMACPPKeySet                                                \
        SHAMD5HMACPPKeySet
#endif
#ifdef ROM_SHAMD5HMACProcess
#define MAP_SHAMD5HMACProcess                                                 \
        ROM_SHAMD5HMACProcess
#else
#define MAP_SHAMD5HMACProcess                                                 \
        SHAMD5HMACProcess
#endif
#ifdef ROM_SHAMD5IntClear
#define MAP_SHAMD5IntClear                                                    \
        ROM_SHAMD5IntClear
#else
#define MAP_SHAMD5IntClear                                                    \
        SHAMD5IntClear
#endif
#ifdef ROM_SHAMD5IntDisable
#define MAP_SHAMD5IntDisable                                                  \
        ROM_SHAMD5IntDisable
#else
#define MAP_SHAMD5IntDisable                                                  \
        SHAMD5IntDisable
#endif
#ifdef ROM_SHAMD5IntEnable
#define MAP_SHAMD5IntEnable                                                   \
        ROM_SHAMD5IntEnable
#else
#define MAP_SHAMD5IntEnable                                                   \
        SHAMD5IntEnable
#endif
#ifdef ROM_SHAMD5Reset
#define MAP_SHAMD5Reset                                                       \
        ROM_SHAMD5Reset
#else
#define MAP_SHAMD5Reset                                                       \
        SHAMD5Reset
#endif
#ifdef ROM_SHAMD5ResultRead
#define MAP_SHAMD5ResultRead                                                  \
        ROM_SHAMD5ResultRead
#else
#define MAP_SHAMD5ResultRead                                                  \
        SHAMD5ResultRead
#endif

